Revit 2026 API

# HemisphericalLightDistribution Properties

---

The HemisphericalLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightDistribution) |

#### Reference

HemisphericalLightDistribution Class

Autodesk.Revit.DB.Lighting Namespace